# DimStyleInteriorTickMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimStyleInteriorTickMark Property
ParameterTypeId Class See Also
---
"Interior Tick Mark"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimStyleInteriorTickMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimStyleInteriorTickMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimStyleInteriorTickMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace